w7d4/NewsReaderApp/app/controllers/api/feeds_controller.rb

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "5"]]
DELETE FROM "feeds" WHERE "feeds"."id" = 5
---
  def destroy
    feed = Feed.find(params[:id])
    feed.delete